import { RumorType } from '@/types';

export const RumorData: RumorType[] = [
  {
    code: 'R001',
    description: `古い魔法使いたちは、価値のある装飾品が他の者の手に渡らないように防護魔法をかけた。\nそのような装飾品は時を経て魔法が変質し、所有者の手を離れない厄介な呪物となってしまうことがある。\nこの手の呪いを解呪するのは神聖な力を扱う教会の十八番だ。`,
    id: 1,
    title: '呪いの解呪法',
  },
  {
    code: 'R002',
    description: `魔法が込められたアクセサリーや装備は、装着者に魔法による加護をもたらすが、いつかは魔力切れになって効果を失ってしまう。\n魔力を補充するには自然の魔力が込められた物体を近くに置き、魔力を吸収させると良い。`,
    id: 2,
    title: '魔導具の充填',
  },
  {
    code: 'R003',
    description: `古い魔法の時代に生み出された危険な魔法は、魔法の研究が進むに連れ禁忌とされ魔導書に封印された。\nその高度な封印の解放は、封印と同等の複雑さを持つ解呪魔法によって達成される。`,
    id: 3,
    title: '封印されし魔法',
  },
  {
    code: 'R004',
    description: `聖霊鹿の肉は大陸三大美食に数えられるほど希少かつ美味。\nしかし聖霊鹿は霊獣と称されるほど人前に姿を表さず、仮に仕留められたとしてもその肉はとても繊細だ。\n人の体温ほどの熱であっという間に腐ってしまうため、入手難易度は非常に高い。`,
    id: 4,
    title: '伝説の霜降り肉',
  },
  {
    code: 'R005',
    description: `「ストライプストーン」と呼ばれる宝石はその美麗な輝きから貴族を中心に高値で取引されるが、市場に出回る数はかなり少ない。\nその理由は、産出地と加工法がドワーフ族によって秘匿されているからであり、噂によると産出地については宝石名が関連しているという。`,
    id: 5,
    title: 'ドワーフの秘宝',
  },
  {
    code: 'R006',
    description: `呪われた大陸に咲く赤い花はその特性から「死の花」と呼ばれて忌避されている。\n不毛な土地に根を張るその植物は過酷な生存競争に勝利するため、種が発芽する際に周辺の有機物をすべて腐らせる瘴気を発生させるという。`,
    id: 6,
    title: '死の花',
  },
  {
    code: 'R007',
    description: `古い王族のひとつに、特殊な儀式を通じて夜空の月から魔力を得ていた者たちがいた。\nしかし、争いの時代に敗れた彼らは侵略を受け歴史から姿を消すことになった。\n彼らの権力を象徴する満月のブローチは侵略者によって左右に割られ、特別な力を失ったという。`,
    id: 7,
    title: '古い王族の魔導具',
  },
  {
    code: 'R008',
    description: `すべての病を治す世界樹の葉は数が少なく、希少性が高かった。\nしかし、近年における魔法学の著しい向上によって同様の働きをする魔法薬が開発されたため、近々それの価値は暴落すると商人たちの間で噂されている`,
    id: 8,
    title: '万能薬',
  },
  {
    code: 'R009',
    description: `教会に語り継がれる言い伝え話のひとつに、「3人の聖女」というものがある。\n敬虔な信者の中には、この伝承の聖女たちを崇拝するものがおり、偶像を欲するものも多いらしい。\n道徳を語るのは商人の仕事ではないが、需要を満たすのは商人の仕事だ。`,
    id: 9,
    title: '3人の聖女',
  },
  {
    code: 'R010',
    description: `大陸にて語り継がれる英雄王の伝説。\nそれは勇敢な王と闇を払う剣、そして力の源たる宝石の物語。\n伝説によると、王は魔王を打ち国を興した後、剣は闇の者の手の届かぬ場所に隠し、宝石は紋章に加工し肌身離さず守ったという。\n王の持ち物たちは今もどこかで継承者の手に渡ることを待っているのかもしれない。`,
    id: 10,
    title: '英雄王の伝説',
  },
];
